app/views/articles/_form.html.haml

  = f.input :content, label: 'Content', input_html: { class: 'form-control' }
  = f.collection_select :category_id, Category.all, :id, :name, { prompt: "Choose a Category" }
---
SELECT "categories".* FROM "categories"