app/controllers/articles_controller.rb

SELECT "categories".* FROM "categories"
SELECT "articles".* FROM "articles" ORDER BY created_at desc
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Technology"], ["LIMIT", 1]]
SELECT "articles".* FROM "articles" WHERE "articles"."category_id" = ? ORDER BY created_at desc  [["category_id", 2]]
---
  def index
    if params[:category].blank?
      @articles = Article.all.order('created_at desc')
    else
      @category_id = Category.find_by(name: params[:category]).id
      @articles = Article.where(category_id: @category_id).order('created_at desc')

INSERT INTO "articles" ("title", "content", "created_at", "updated_at", "user_id", "category_id") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @article = current_user.articles.build(article_params)
    if @article.save